app/Controllers/Home.php

SELECT *
FROM `prodi`
---
    public function edit($id)
    {
        $datamh = $this->mahasiswadb->getDataMhsById($id);
        $dataprodi = $this->prodimhs->findAll();

UPDATE `mahasiswa` SET `nim` = '22039094', `nama_mhs` = 'retno', `tempat_lahir` = 'sumenep', `tgl_lahir` = '2000-07-13', `kode_prodi` = '55202'
WHERE `mahasiswa`.`nim` IN ('22039094')
---
    public function prosesedit()
    {

        $nim = $this->request->getVar('nim');
        $nama_mhs = $this->request->getVar('nama');
        $tempat_lahir = $this->request->getVar('tempat_lahir');
        $tgl_lahir = $this->request->getVar('tgl_lahir');
        $kode_prodi = $this->request->getVar('nama_prodi');

        $data = [
            'nim' => $nim,
            'nama_mhs' => $nama_mhs,
            'tempat_lahir' => $tempat_lahir,
            'tgl_lahir' => $tgl_lahir,
            'kode_prodi' => $kode_prodi
        ];

        // dd($data);
        // $this->mahasiswadb->set($data);
        // $this->mahasiswadb->where('nim', $nim);
        $this->mahasiswadb->update($nim, $data);