app/Models/Jadwal.php

SELECT `matakuliah`.*, `dosen`.`nama_dosen`, `mahasiswa`.`nim`
FROM `jadwal`
JOIN `mahasiswa` ON `mahasiswa`.`nim` = `jadwal`.`nim`
JOIN `dosen` ON `dosen`.`id_dosen` = `jadwal`.`id_dosen`
JOIN `matakuliah` ON `matakuliah`.`id_matkul` = `jadwal`.`id_matkul`
WHERE `jadwal`.`nim` = '22039090'
---
    public function getJadwalMhs($id)
    {
        $builder = $this->db->table('jadwal');
        $builder->select('matakuliah.*, dosen.nama_dosen, mahasiswa.nim');
        $builder->join('mahasiswa', 'mahasiswa.nim = jadwal.nim');
        $builder->join('dosen', 'dosen.id_dosen = jadwal.id_dosen');
        $builder->join('matakuliah', 'matakuliah.id_matkul = jadwal.id_matkul');
        $builder->where('jadwal.nim', $id);
        $query = $builder->get();