app/Models/Mahasiswa.php

SELECT `mahasiswa`.*, `prodi`.`nama_prodi`
FROM `mahasiswa`
JOIN `prodi` ON `prodi`.`kode_prodi` = `mahasiswa`.`kode_prodi`
---
    public function getDataMhs()
    {
        $builder = $this->db->table('mahasiswa');
        $builder->select('mahasiswa.*, prodi.nama_prodi');
        $builder->join('prodi', 'prodi.kode_prodi = mahasiswa.kode_prodi');
        $query = $builder->get();

SELECT `mahasiswa`.*, `prodi`.`nama_prodi`
FROM `mahasiswa`
JOIN `prodi` ON `prodi`.`kode_prodi` = `mahasiswa`.`kode_prodi`
WHERE `nim` = '22039094'
---
    public function getDataMhsById($id)
    {
        $builder = $this->db->table('mahasiswa');
        $builder->select('mahasiswa.*, prodi.nama_prodi');
        $builder->join('prodi', 'prodi.kode_prodi = mahasiswa.kode_prodi');
        $builder->where('nim', $id);
        $query = $builder->get();